export const THAI_CONSONANTS = [
  'ก', 'ข', 'ฃ', 'ค', 'ฅ', 'ฆ', 'ง',
  'จ', 'ฉ', 'ช', 'ซ', 'ฌ', 'ญ',
  'ฎ', 'ฏ', 'ฐ', 'ฑ', 'ฒ', 'ณ',
  'ด', 'ต', 'ถ', 'ท', 'ธ', 'น',
  'บ', 'ป', 'ผ', 'ฝ', 'พ', 'ฟ', 'ภ', 'ม',
  'ย', 'ร', 'ล', 'ว',
  'ศ', 'ษ', 'ส', 'ห', 'ฬ', 'อ', 'ฮ',
]

export const THAI_CONSONANT_NAMES = {
  'ก': 'ก ไก่', 'ข': 'ข ไข่', 'ฃ': 'ฃ ขวด', 'ค': 'ค ควาย', 'ฅ': 'ฅ คน', 'ฆ': 'ฆ ระฆัง',
  'ง': 'ง งู',
  'จ': 'จ จาน', 'ฉ': 'ฉ ฉิ่ง', 'ช': 'ช ช้าง', 'ซ': 'ซ โซ่', 'ฌ': 'ฌ เฌอ', 'ญ': 'ญ หญิง',
  'ฎ': 'ฎ ชฎา', 'ฏ': 'ฏ ปฏัก', 'ฐ': 'ฐ ฐาน', 'ฑ': 'ฑ มณโฑ', 'ฒ': 'ฒ ผู้เฒ่า', 'ณ': 'ณ เณร',
  'ด': 'ด เด็ก', 'ต': 'ต เต่า', 'ถ': 'ถ ถุง', 'ท': 'ท ทหาร', 'ธ': 'ธ ธง', 'น': 'น หนู',
  'บ': 'บ ใบไม้', 'ป': 'ป ปลา', 'ผ': 'ผ ผึ้ง', 'ฝ': 'ฝ ฝา', 'พ': 'พ พาน', 'ฟ': 'ฟ ฟัน', 'ภ': 'ภ สำเภา',
  'ม': 'ม ม้า', 'ย': 'ย ยักษ์', 'ร': 'ร เรือ', 'ล': 'ล ลิง', 'ว': 'ว แหวน',
  'ศ': 'ศ ศาลา', 'ษ': 'ษ ฤๅษี', 'ส': 'ส เสือ', 'ห': 'ห หีบ', 'ฬ': 'ฬ จุฬา', 'อ': 'อ อ่าง', 'ฮ': 'ฮ นกฮูก',
}
